# Apply function - All Powerful

### allows uou tro applyu any kind of function to any data in a dataframe. anything i want to do in python,, write a function and then use it in our data

In [29]:
import pandas as pd
import numpy as np
# create data
stuff = {
    'Corporation':['Apple','Google','Meta','Apple','Google','Meta'],
    'Employees':['John','April','Wes','Beth','Justin','Steph'],
    'Salary':[200,220,190,130,120,150]
}

# create datafram
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [8]:
# create function
def times1000(x):
    return format(x*1000, ",d")

In [9]:
# use apply function
pd.DataFrame(my_df["Salary"].apply(times1000))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

In [12]:
# add elder alst name
def namer(x):
    if x=="John":
        return "John Elder"
    else:
        return "Not important"

In [13]:
my_df["Employees"].apply(namer)

0       John Elder
1    Not important
2    Not important
3    Not important
4    Not important
5    Not important
Name: Employees, dtype: str

In [15]:
# use lambda functions: write the functions in place in line and no need to write them seperated
pd.DataFrame(my_df["Salary"].apply(lambda x : x*1000))

   Salary
0  200000
1  220000
2  190000
3  130000
4  120000
5  150000

## Apply function on Multiple columns

In [16]:
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [17]:
# function on multiple columns
def namer(x):
    return "prem "+x

In [18]:
#app;t to the cols
my_df[["Corporation", "Employees"]].apply(namer)

   Corporation    Employees
0   prem Apple    prem John
1  prem Google   prem April
2    prem Meta     prem Wes
3   prem Apple    prem Beth
4  prem Google  prem Justin
5    prem Meta   prem Steph

In [19]:
my_df[["Corporation", "Employees"]]=my_df[["Corporation", "Employees"]].apply(namer)

In [20]:
my_df

   Corporation    Employees  Salary
0   prem Apple    prem John     200
1  prem Google   prem April     220
2    prem Meta     prem Wes     190
3   prem Apple    prem Beth     130
4  prem Google  prem Justin     120
5    prem Meta   prem Steph     150

## Sorting and ordering data

In [22]:
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [ ]:
# sorting in ascending order
my_df.sort_values("Salary")

  Corporation Employees  Salary
4      Google    Justin     120
3       Apple      Beth     130
5        Meta     Steph     150
2        Meta       Wes     190
0       Apple      John     200
1      Google     April     220

In [27]:
# osring in descending order
my_df.sort_values("Salary", ascending = False, inplace = True)

In [28]:
my_df

  Corporation Employees  Salary
1      Google     April     220
0       Apple      John     200
2        Meta       Wes     190
5        Meta     Steph     150
3       Apple      Beth     130
4      Google    Justin     120

In [ ]:
# works for strings as well

my_df.sort_values("Corporation")

  Corporation Employees  Salary
0       Apple      John     200
3       Apple      Beth     130
1      Google     April     220
4      Google    Justin     120
2        Meta       Wes     190
5        Meta     Steph     150